tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1612_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC12LF1612_H_
#define _PIC12LF1612_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PIR1                          42
#define TMR1IF                        43
#define TMR2IF                        44
#define CCP1IF                        45
#define ADIF                          46
#define TMR1GIF                       47
#define PIR2                          48
#define CCP2IF                        49
#define TMR4IF                        50
#define TMR6IF                        51
#define C1IF                          52
#define C2IF                          53
#define PIR3                          54
#define ZCDIF                         55
#define CWGIF                         56
#define PIR4                          57
#define SMT1IF                        58
#define SMT1PRAIF                     59
#define SMT1PWAIF                     60
#define SMT2IF                        61
#define SMT2PRAIF                     62
#define SMT2PWAIF                     63
#define CRCIF                         64
#define SCANIF                        65
#define TMR0                          66
#define TMR1L                         67
#define TMR1H                         68
#define T1CON                         69
#define TMR1ON                        70
#define nT1SYNC                       71
#define T1CKPS0                       72
#define T1CKPS                        73
#define T1CKPS1                       74
#define TMR1CS0                       75
#define TMR1CS                        76
#define TMR1CS1                       77
#define T1GCON                        78
#define T1GSS0                        79
#define T1GSS                         80
#define T1GSS1                        81
#define T1GVAL                        82
#define T1GGO_nDONE                   83
#define T1GSPM                        84
#define T1GTM                         85
#define T1GPOL                        86
#define TMR1GE                        87
#define T2TMR                         88
#define TMR2                          89
#define T2PR                          90
#define PR2                           91
#define T2CON                         92
#define T2OUTPS0                      93
#define T2CON_OUTPS0                  94
#define T2OUTPS                       95
#define T2CON_OUTPS                   96
#define T2OUTPS1                      97
#define T2CON_OUTPS1                  98
#define T2OUTPS2                      99
#define T2CON_OUTPS2                  100
#define T2OUTPS3                      101
#define T2CON_OUTPS3                  102
#define T2CKPS0                       103
#define T2CON_CKPS                    104
#define T2CKPS                        105
#define T2CON_CKPS0                   106
#define T2CKPS1                       107
#define T2CON_CKPS1                   108
#define T2CKPS2                       109
#define T2CON_CKPS2                   110
#define T2CON_ON                      111
#define TMR2ON                        112
#define T2ON                          113
#define T2HLT                         114
#define T2HLT_MODE                    115
#define T2MODE0                       116
#define T2HLT_MODE0                   117
#define T2MODE                        118
#define T2HLT_MODE1                   119
#define T2MODE1                       120
#define T2MODE2                       121
#define T2HLT_MODE2                   122
#define T2HLT_MODE3                   123
#define T2MODE3                       124
#define T2HLT_CKSYNC                  125
#define T2CKSYNC                      126
#define T2HLT_CKPOL                   127
#define T2CKPOL                       128
#define T2PSYNC                       129
#define T2HLT_PSYNC                   130
#define T2CLKCON                      131
#define T2CS                          132
#define T2CS0                         133
#define T2CS1                         134
#define T2CS2                         135
#define T2RST                         136
#define T2RSEL0                       137
#define T2RST_RSEL                    138
#define T2RSEL                        139
#define T2RST_RSEL0                   140
#define T2RSEL1                       141
#define T2RST_RSEL1                   142
#define T2RST_RSEL2                   143
#define T2RSEL2                       144
#define T2RSEL3                       145
#define T2RST_RSEL3                   146
#define TRISA                         147
#define TRISA0                        148
#define TRISA1                        149
#define TRISA2                        150
#define TRISA3                        151
#define TRISA4                        152
#define TRISA5                        153
#define PIE1                          154
#define TMR1IE                        155
#define TMR2IE                        156
#define CCP1IE                        157
#define ADIE                          158
#define TMR1GIE                       159
#define PIE2                          160
#define CCP2IE                        161
#define TMR4IE                        162
#define TMR6IE                        163
#define C1IE                          164
#define C2IE                          165
#define PIE3                          166
#define ZCDIE                         167
#define CWGIE                         168
#define PIE4                          169
#define SMT1IE                        170
#define SMT1PRAIE                     171
#define SMT1PWAIE                     172
#define SMT2IE                        173
#define SMT2PRAIE                     174
#define SMT2PWAIE                     175
#define CRCIE                         176
#define SCANIE                        177
#define OPTION_REG                    178
#define PS                            179
#define PS0                           180
#define PS1                           181
#define PS2                           182
#define PSA                           183
#define T0SE                          184
#define TMR0SE                        185
#define T0CS                          186
#define TMR0CS                        187
#define INTEDG                        188
#define nWPUEN                        189
#define PCON                          190
#define nBOR                          191
#define nPOR                          192
#define nRI                           193
#define nRMCLR                        194
#define nRWDT                         195
#define nWDTWV                        196
#define STKUNF                        197
#define STKOVF                        198
#define OSCTUNE                       199
#define TUN0                          200
#define TUN                           201
#define TUN1                          202
#define TUN2                          203
#define TUN3                          204
#define TUN4                          205
#define TUN5                          206
#define OSCCON                        207
#define SCS0                          208
#define SCS                           209
#define SCS1                          210
#define IRCF                          211
#define IRCF0                         212
#define IRCF1                         213
#define IRCF2                         214
#define IRCF3                         215
#define SPLLEN                        216
#define OSCSTAT                       217
#define HFIOFS                        218
#define LFIOFR                        219
#define MFIOFR                        220
#define HFIOFL                        221
#define HFIOFR                        222
#define PLLR                          223
#define ADRESL                        224
#define ADRESH                        225
#define ADCON0                        226
#define ADON                          227
#define GO_nDONE                      228
#define GO                            229
#define ADGO                          230
#define CHS0                          231
#define CHS                           232
#define CHS1                          233
#define CHS2                          234
#define CHS3                          235
#define CHS4                          236
#define ADCON1                        237
#define ADPREF0                       238
#define ADPREF                        239
#define ADPREF1                       240
#define ADCS0                         241
#define ADCS                          242
#define ADCS1                         243
#define ADCS2                         244
#define ADFM                          245
#define ADCON2                        246
#define TRIGSEL                       247
#define TRIGSEL0                      248
#define TRIGSEL1                      249
#define TRIGSEL2                      250
#define TRIGSEL3                      251
#define LATA                          252
#define LATA0                         253
#define LATA1                         254
#define LATA2                         255
#define LATA3                         256
#define LATA4                         257
#define LATA5                         258
#define CM1CON0                       259
#define C1SYNC                        260
#define C1HYS                         261
#define C1SP                          262
#define C1POL                         263
#define C1OE                          264
#define C1OUT                         265
#define C1ON                          266
#define CM1CON1                       267
#define C1NCH0                        268
#define C1NCH                         269
#define C1NCH1                        270
#define C1NCH2                        271
#define C1PCH                         272
#define C1PCH0                        273
#define C1PCH1                        274
#define C1INTN                        275
#define C1INTP                        276
#define CMOUT                         277
#define MC1OUT                        278
#define BORCON                        279
#define BORRDY                        280
#define BORFS                         281
#define SBOREN                        282
#define FVRCON                        283
#define ADFVR0                        284
#define ADFVR                         285
#define ADFVR1                        286
#define CDAFVR                        287
#define CDAFVR0                       288
#define CDAFVR1                       289
#define TSRNG                         290
#define TSEN                          291
#define FVRRDY                        292
#define FVREN                         293
#define DAC1CON0                      294
#define DAC1PSS                       295
#define D1PSS0                        296
#define D1PSS1                        297
#define DAC1OE                        298
#define DAC1EN                        299
#define DAC1CON1                      300
#define DAC1R                         301
#define DAC1R0                        302
#define DAC1R1                        303
#define DAC1R2                        304
#define DAC1R3                        305
#define DAC1R4                        306
#define DAC1R5                        307
#define DAC1R6                        308
#define DAC1R7                        309
#define ZCD1CON                       310
#define ZCD1INTN                      311
#define ZCD1INTP                      312
#define ZCD1POL                       313
#define ZCD1OUT                       314
#define ZCD1OE                        315
#define ZCD1EN                        316
#define APFCON                        317
#define CCP1SEL                       318
#define T1GSEL                        319
#define CWGBSEL                       320
#define CWGASEL                       321
#define ANSA0                         322
#define ANSELA                        323
#define ANSA1                         324
#define ANSA2                         325
#define ANSA4                         326
#define PMADRL                        327
#define PMADRH                        328
#define PMDATL                        329
#define PMDATH                        330
#define PMCON1                        331
#define RD                            332
#define WR                            333
#define WREN                          334
#define WRERR                         335
#define FREE                          336
#define LWLO                          337
#define CFGS                          338
#define PMCON2                        339
#define WPUA0                         340
#define WPUA                          341
#define WPUA1                         342
#define WPUA2                         343
#define WPUA3                         344
#define WPUA4                         345
#define WPUA5                         346
#define ODCONA                        347
#define ODA0                          348
#define ODA1                          349
#define ODA2                          350
#define ODA4                          351
#define ODA5                          352
#define CCPR1L                        353
#define CCPR1L_RL                     354
#define CCPR1H                        355
#define CCPR1H_RH                     356
#define CCP1CON                       357
#define CCP1MODE0                     358
#define CCP1CON_MODE0                 359
#define CCP1CON_MODE                  360
#define CCP1MODE                      361
#define CCP1MODE1                     362
#define CCP1CON_MODE1                 363
#define CCP1MODE2                     364
#define CCP1CON_MODE2                 365
#define CCP1MODE3                     366
#define CCP1CON_MODE3                 367
#define CCP1FMT                       368
#define CCP1CON_FMT                   369
#define CCP1CON_OUT                   370
#define CCP1OUT                       371
#define CCP1CON_OE                    372
#define CCP1OE                        373
#define CCP1EN                        374
#define CCP1CON_EN                    375
#define CCP1CAP                       376
#define CCP1CTS0                      377
#define CCP1CAP_CTS                   378
#define CCP1CAP_CTS0                  379
#define CCP1CTS                       380
#define CCP1CTS1                      381
#define CCP1CAP_CTS1                  382
#define CCPR2L                        383
#define CCPR2L_RL                     384
#define CCPR2H                        385
#define CCPR2H_RH                     386
#define CCP2CON                       387
#define CCP2MODE                      388
#define CCP2MODE0                     389
#define CCP2CON_MODE0                 390
#define CCP2CON_MODE                  391
#define CCP2MODE1                     392
#define CCP2CON_MODE1                 393
#define CCP2MODE2                     394
#define CCP2CON_MODE2                 395
#define CCP2MODE3                     396
#define CCP2CON_MODE3                 397
#define CCP2FMT                       398
#define CCP2CON_FMT                   399
#define CCP2OUT                       400
#define CCP2CON_OUT                   401
#define CCP2OE                        402
#define CCP2CON_OE                    403
#define CCP2EN                        404
#define CCP2CON_EN                    405
#define CCP2CAP                       406
#define CCP2CAP_CTS                   407
#define CCP2CAP_CTS0                  408
#define CCP2CTS                       409
#define CCP2CTS0                      410
#define CCP2CAP_CTS1                  411
#define CCP2CTS1                      412
#define CCPTMRS                       413
#define CCP1TSEL0                     414
#define CCP1TSEL                      415
#define CCP1TSEL1                     416
#define CCP2TSEL0                     417
#define CCP2TSEL                      418
#define CCP2TSEL1                     419
#define SLRCONA                       420
#define SLRA0                         421
#define SLRA1                         422
#define SLRA2                         423
#define SLRA4                         424
#define SLRA5                         425
#define INLVLA                        426
#define INLVLA0                       427
#define INLVLA1                       428
#define INLVLA2                       429
#define INLVLA3                       430
#define INLVLA4                       431
#define INLVLA5                       432
#define T4TMR                         433
#define TMR4                          434
#define T4PR                          435
#define PR4                           436
#define T4CON                         437
#define T4OUTPS0                      438
#define T4CON_OUTPS                   439
#define T4OUTPS                       440
#define T4CON_OUTPS0                  441
#define T4OUTPS1                      442
#define T4CON_OUTPS1                  443
#define T4CON_OUTPS2                  444
#define T4OUTPS2                      445
#define T4OUTPS3                      446
#define T4CON_OUTPS3                  447
#define T4CON_CKPS0                   448
#define T4CKPS0                       449
#define T4CON_CKPS                    450
#define T4CKPS                        451
#define T4CKPS1                       452
#define T4CON_CKPS1                   453
#define T4CKPS2                       454
#define T4CON_CKPS2                   455
#define T4ON                          456
#define T4CON_ON                      457
#define TMR4ON                        458
#define T4HLT                         459
#define T4MODE                        460
#define T4HLT_MODE                    461
#define T4HLT_MODE0                   462
#define T4MODE0                       463
#define T4HLT_MODE1                   464
#define T4MODE1                       465
#define T4HLT_MODE2                   466
#define T4MODE2                       467
#define T4HLT_MODE3                   468
#define T4MODE3                       469
#define T4HLT_CKSYNC                  470
#define T4CKSYNC                      471
#define T4HLT_CKPOL                   472
#define T4CKPOL                       473
#define T4PSYNC                       474
#define T4HLT_PSYNC                   475
#define T4CLKCON                      476
#define T4CS0                         477
#define T4CS                          478
#define T4CS1                         479
#define T4CS2                         480
#define T4RST                         481
#define T4RSEL0                       482
#define T4RSEL                        483
#define T4RST_RSEL                    484
#define T4RST_RSEL0                   485
#define T4RSEL1                       486
#define T4RST_RSEL1                   487
#define T4RSEL2                       488
#define T4RST_RSEL2                   489
#define T4RSEL3                       490
#define T4RST_RSEL3                   491
#define T6TMR                         492
#define TMR6                          493
#define T6PR                          494
#define PR6                           495
#define T6CON                         496
#define T6CON_OUTPS0                  497
#define T6OUTPS                       498
#define T6CON_OUTPS                   499
#define T6OUTPS0                      500
#define T6CON_OUTPS1                  501
#define T6OUTPS1                      502
#define T6CON_OUTPS2                  503
#define T6OUTPS2                      504
#define T6CON_OUTPS3                  505
#define T6OUTPS3                      506
#define T6CON_CKPS0                   507
#define T6CKPS                        508
#define T6CKPS0                       509
#define T6CON_CKPS                    510
#define T6CON_CKPS1                   511
#define T6CKPS1                       512
#define T6CON_CKPS2                   513
#define T6CKPS2                       514
#define TMR6ON                        515
#define T6ON                          516
#define T6CON_ON                      517
#define T6HLT                         518
#define T6HLT_MODE0                   519
#define T6HLT_MODE                    520
#define T6MODE0                       521
