tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1612_tdd.h
#define T6MODE                        522
#define T6HLT_MODE1                   523
#define T6MODE1                       524
#define T6MODE2                       525
#define T6HLT_MODE2                   526
#define T6HLT_MODE3                   527
#define T6MODE3                       528
#define T6CKSYNC                      529
#define T6HLT_CKSYNC                  530
#define T6CKPOL                       531
#define T6HLT_CKPOL                   532
#define T6PSYNC                       533
#define T6HLT_PSYNC                   534
#define T6CLKCON                      535
#define T6CS                          536
#define T6CS0                         537
#define T6CS1                         538
#define T6CS2                         539
#define T6RST                         540
#define T6RST_RSEL                    541
#define T6RST_RSEL0                   542
#define T6RSEL                        543
#define T6RSEL0                       544
#define T6RST_RSEL1                   545
#define T6RSEL1                       546
#define T6RSEL2                       547
#define T6RST_RSEL2                   548
#define T6RST_RSEL3                   549
#define T6RSEL3                       550
#define CWG1DBR0                      551
#define CWG1DBR                       552
#define DBR                           553
#define DBR0                          554
#define CWG1DBR1                      555
#define DBR1                          556
#define CWG1DBR2                      557
#define DBR2                          558
#define CWG1DBR3                      559
#define DBR3                          560
#define CWG1DBR4                      561
#define DBR4                          562
#define CWG1DBR5                      563
#define DBR5                          564
#define CWG1DBF                       565
#define CWG1DBF0                      566
#define DBF                           567
#define DBF0                          568
#define CWG1DBF1                      569
#define DBF1                          570
#define CWG1DBF2                      571
#define DBF2                          572
#define CWG1DBF3                      573
#define DBF3                          574
#define CWG1DBF4                      575
#define DBF4                          576
#define DBF5                          577
#define CWG1DBF5                      578
#define CWG1AS0                       579
#define CWG1LSAC                      580
#define LSAC                          581
#define LSAC0                         582
#define CWG1LSAC0                     583
#define LSAC1                         584
#define CWG1LSAC1                     585
#define LSBD0                         586
#define CWG1LSBD0                     587
#define LSBD                          588
#define CWG1LSBD                      589
#define LSBD1                         590
#define CWG1LSBD1                     591
#define CWG1REN                       592
#define REN                           593
#define CWG1SHUTDOWN                  594
#define SHUTDOWN                      595
#define CWG1AS1                       596
#define INAS                          597
#define CWG1INAS                      598
#define C1AS                          599
#define CWG1C1AS                      600
#define C2AS                          601
#define CWG1C2AS                      602
#define TMR2AS                        603
#define CWG1TMR2AS                    604
#define CWG1TMR4AS                    605
#define TMR4AS                        606
#define CWG1TMR6AS                    607
#define TMR6AS                        608
#define CWG1OCON0                     609
#define CWG1STRA                      610
#define STRA                          611
#define STRB                          612
#define CWG1STRB                      613
#define CWG1STRC                      614
#define STRC                          615
#define CWG1STRD                      616
#define STRD                          617
#define OVRA                          618
#define CWG1OVRA                      619
#define CWG1OVRB                      620
#define OVRB                          621
#define OVRC                          622
#define CWG1OVRC                      623
#define OVRD                          624
#define CWG1OVRD                      625
#define CWG1CON0                      626
#define CWG1MODE0                     627
#define CWG1CON0_MODE0                628
#define CWG1MODE                      629
#define CWG1CON0_MODE                 630
#define CWG1MODE1                     631
#define CWG1CON0_MODE1                632
#define CWG1MODE2                     633
#define CWG1CON0_MODE2                634
#define LD                            635
#define CWG1LD                        636
#define CWG1CON0_EN                   637
#define CWG1EN                        638
#define G1EN                          639
#define CWG1CON1                      640
#define CWG1POLA                      641
#define POLA                          642
#define CWG1POLB                      643
#define POLB                          644
#define CWG1POLC                      645
#define POLC                          646
#define CWG1POLD                      647
#define POLD                          648
#define IN                            649
#define CWG1IN                        650
#define CWG1OCON1                     651
#define CWG1OEA                       652
#define OEA                           653
#define CWG1OEB                       654
#define OEB                           655
#define CWG1OEC                       656
#define OEC                           657
#define CWG1OED                       658
#define OED                           659
#define CWG1CLKCON                    660
#define CS                            661
#define CWG1CS                        662
#define CWG1ISM                       663
#define CWG1IS                        664
#define IS                            665
#define IS0                           666
#define CWG1IS0                       667
#define CWG1IS1                       668
#define IS1                           669
#define IS2                           670
#define CWG1IS2                       671
#define WDTCON0                       672
#define SWDTEN                        673
#define SEN                           674
#define WDTSEN                        675
#define WDTPS                         676
#define WDTPS0                        677
#define WDTPS1                        678
#define WDTPS2                        679
#define WDTPS3                        680
#define WDTPS4                        681
#define WDTCON1                       682
#define WDTWINDOW0                    683
#define WINDOW0                       684
#define WINDOW                        685
#define WDTWINDOW                     686
#define WDTWINDOW1                    687
#define WINDOW1                       688
#define WDTWINDOW2                    689
#define WINDOW2                       690
#define WDTCS                         691
#define WDTCS0                        692
#define WDTCS1                        693
#define WDTCS2                        694
#define WDTPSL                        695
#define WDTPSL_WDTPSCNT               696
#define WDTPSL_PSCNT                  697
#define WDTPSCNT0                     698
#define PSCNT0                        699
#define WDTPSCNT1                     700
#define PSCNT1                        701
#define WDTPSCNT2                     702
#define PSCNT2                        703
#define WDTPSCNT3                     704
#define PSCNT3                        705
#define WDTPSCNT4                     706
#define PSCNT4                        707
#define WDTPSCNT5                     708
#define PSCNT5                        709
#define WDTPSCNT6                     710
#define PSCNT6                        711
#define WDTPSCNT7                     712
#define PSCNT7                        713
#define WDTPSH                        714
#define PSCNT8                        715
#define WDTPSH_WDTPSCNT               716
#define WDTPSH_PSCNT                  717
#define WDTPSCNT8                     718
#define PSCNT9                        719
#define WDTPSCNT9                     720
#define PSCNT10                       721
#define WDTPSCNT10                    722
#define PSCNT11                       723
#define WDTPSCNT11                    724
#define PSCNT12                       725
#define WDTPSCNT12                    726
#define PSCNT13                       727
#define WDTPSCNT13                    728
#define PSCNT14                       729
#define WDTPSCNT14                    730
#define PSCNT15                       731
#define WDTPSCNT15                    732
#define PSCNT16                       733
#define WDTPSCNT16                    734
#define WDTPSCNT17                    735
#define PSCNT17                       736
#define STATE                         737
#define WDTSTATE                      738
#define WDTTMR                        739
#define WDTTMR0                       740
#define WDTTMR1                       741
#define WDTTMR2                       742
#define WDTTMR3                       743
#define WDTTMR4                       744
#define SCANLADRL                     745
#define SCANLADRL_LADR                746
#define LDAR0                         747
#define SCANLADRL_SCANLADR            748
#define SCANLADR0                     749
#define SCANLADR1                     750
#define LDAR1                         751
#define LADR2                         752
#define SCANLADR2                     753
#define LADR3                         754
#define SCANLADR3                     755
#define LADR4                         756
#define SCANLADR4                     757
#define LADR5                         758
#define SCANLADR5                     759
#define SCANLADR6                     760
#define LADR6                         761
#define LADR7                         762
#define SCANLADR7                     763
#define SCANLADRH                     764
#define LADR8                         765
#define SCANLADRH_SCANLADR            766
#define SCANLADR8                     767
#define SCANLADRH_LADR                768
#define LADR9                         769
#define SCANLADR9                     770
#define LADR10                        771
#define SCANLADR10                    772
#define SCANLADR11                    773
#define LADR11                        774
#define LADR12                        775
#define SCANLADR12                    776
#define LADR13                        777
#define SCANLADR13                    778
#define LADR14                        779
#define SCANLADR14                    780
#define LADR15                        781
#define SCANLADR15                    782
#define SCANHADRL                     783
#define SCANHADR0                     784
#define HADR0                         785
#define SCANHADRL_HADR                786
#define SCANHADRL_SCANHADR            787
#define SCANHADR1                     788
#define HADR1                         789
#define SCANHADR2                     790
#define HARD2                         791
#define SCANHADR3                     792
#define HADR3                         793
#define SCANHADR4                     794
#define HADR4                         795
#define SCANHADR5                     796
#define HADR5                         797
#define SCANHADR6                     798
#define HADR6                         799
#define SCANHADR7                     800
#define HADR7                         801
#define SCANHADRH                     802
#define HADR8                         803
#define SCANHADRH_SCANHADR            804
#define SCANHADR8                     805
#define SCANHADRH_HADR                806
#define HADR9                         807
#define SCANHADR9                     808
#define HADR10                        809
#define SCANHADR10                    810
#define SCANHADR11                    811
#define HADR11                        812
#define HADR12                        813
#define SCANHADR12                    814
#define HADR13                        815
#define SCANHADR13                    816
#define HADR14                        817
#define SCANHADR14                    818
#define HADR15                        819
#define SCANHADR15                    820
#define SCANCON0                      821
#define SCANMODE                      822
#define SCANMODE0                     823
#define SCANCON0_MODE                 824
#define SCANCON0_MODE0                825
#define SCANCON0_MODE1                826
#define SCANMODE1                     827
#define INTM                          828
#define SCANINTM                      829
#define INVALID                       830
#define SCANINVALID                   831
#define SCANCON0_BUSY                 832
#define SCANBUSY                      833
#define SCANGO                        834
#define SCANEN                        835
#define SCANCON0_EN                   836
#define SCANTRIG                      837
#define TSEL0                         838
#define TSEL                          839
#define SCANTSEL0                     840
#define SCANTSEL                      841
#define TSEL1                         842
#define SCANTSEL1                     843
#define CRCDATL                       844
#define CRCDATL_DAT                   845
#define CRCDAT0                       846
#define DAT0                          847
#define CRCDATL_CRCDAT                848
#define CRCDAT1                       849
#define DAT1                          850
#define CRCDAT2                       851
#define DAT2                          852
#define CRCDAT3                       853
#define DAT3                          854
#define CRCDAT4                       855
#define DAT4                          856
#define CRCDAT5                       857
#define DAT5                          858
#define CRCDAT6                       859
#define DAT6                          860
#define DAT7                          861
#define CRDCDAT7                      862
#define CRCDATH                       863
#define CRCDAT8                       864
#define DAT8                          865
#define CRCDATH_CRCDAT                866
#define CRCDATH_DAT                   867
#define CRCDAT9                       868
#define DAT9                          869
#define DAT10                         870
#define CRCDAT10                      871
#define DAT11                         872
#define CRCDAT11                      873
#define DAT12                         874
#define CRCDAT12                      875
#define DAT13                         876
#define CRCDAT13                      877
#define DAT14                         878
#define CRCDAT14                      879
#define DAT15                         880
#define CRCDAT15                      881
#define CRCACCL                       882
#define CRCACC0                       883
#define CRCACCL_ACC                   884
#define CRCACCL_CRCACC                885
#define ACC0                          886
#define CRCACC1                       887
#define ACC1                          888
#define CRCACC2                       889
#define ACC2                          890
#define CRCACC3                       891
#define ACC3                          892
#define CRCACC4                       893
#define ACC4                          894
#define CRCACC5                       895
#define ACC5                          896
#define CRCACC6                       897
#define ACC6                          898
#define CRCACC7                       899
#define ACC7                          900
#define CRCACCH                       901
#define CRCACCH_CRCACC                902
#define CRCACC8                       903
#define CRCACCH_ACC                   904
#define ACC8                          905
#define CRCACC9                       906
#define ACC9                          907
#define CRCACC10                      908
#define ACC10                         909
#define CRCACC11                      910
#define ACC11                         911
#define CRCACC12                      912
#define ACC12                         913
#define CRCACC13                      914
#define ACC13                         915
#define ACC14                         916
#define CRCACC14                      917
#define CRCACC15                      918
#define ACC15                         919
#define CRCSHIFTL                     920
#define CRCSHIFTL_CRCSHIFT            921
#define CRCSHIFTL_SHIFT               922
#define SHIFT0                        923
#define CRCSHIFT0                     924
#define SHIFT1                        925
#define CRCSHIFT1                     926
#define SHIFT2                        927
#define CRCSHIFT2                     928
#define SHIFT3                        929
#define CRCSHIFT3                     930
#define SHIFT4                        931
#define CRCSHIFT4                     932
#define SHIFT5                        933
#define CRCSHIFT5                     934
#define SHIFT6                        935
#define CRCSHIFT6                     936
#define SHIFT7                        937
#define CRCSHIFT7                     938
#define CRCSHIFTH                     939
#define CRCSHIFT8                     940
#define CRCSHIFTH_SHIFT               941
#define CRCSHIFTH_CRCSHIFT            942
#define SHIFT8                        943
#define CRCSHIFT9                     944
#define SHIFT9                        945
#define SHIFT10                       946
#define CRCSHIFT10                    947
#define SHIFT11                       948
#define CRCSHIFT11                    949
#define SHIFT12                       950
#define CRCSHIFT12                    951
#define SHIFT13                       952
#define CRCSHIFT13                    953
#define CRCSHIFT14                    954
#define SHIFT14                       955
#define SHIFT15                       956
#define CRCSHIFT15                    957
#define CRCXORL                       958
#define XOR1                          959
#define CRCXOR1                       960
#define XOR2                          961
#define CRCXOR2                       962
#define XOR3                          963
#define CRCXOR3                       964
#define XOR4                          965
#define CRCXOR4                       966
#define XOR5                          967
#define CRCXOR5                       968
#define XOR6                          969
#define CRCXOR6                       970
#define XOR7                          971
#define CRCXOR7                       972
#define CRCXORH                       973
#define XOR8                          974
#define CRCXOR8                       975
#define XOR9                          976
#define CRCXOR9                       977
#define CRCXOR10                      978
#define XOR10                         979
#define CRCXOR11                      980
#define XOR11                         981
#define XOR12                         982
#define CRCXOR12                      983
#define XOR13                         984
#define CRCXOR13                      985
#define CRCXOR14                      986
#define XOR14                         987
#define CRCXOR15                      988
#define XOR15                         989
#define CRCCON0                       990
#define CRCFULL                       991
#define FULL                          992
#define CRCSHIFTM                     993
#define SHIFTM                        994
#define ACCM                          995
#define CRCACCM                       996
#define CRCCON0_BUSY                  997
#define CRCBUSY                       998
#define CRCGO                         999
#define CRCCON0_EN                    1000
#define CRCEN                         1001
#define CRCCON1                       1002
#define PLEN0                         1003
#define CRCPLEN0                      1004
#define PLEN                          1005
#define CRCPLEN                       1006
#define PLEN1                         1007
#define CRCPLEN1                      1008
#define PLEN2                         1009
#define CRCPLEN2                      1010
#define PLEN3                         1011
#define CRCPLEN3                      1012
#define DLEN                          1013
#define CRCDLEN                       1014
#define CRCDLEN0                      1015
#define DLEN0                         1016
#define DLEN1                         1017
#define CRCDLEN1                      1018
#define CRCDLEN2                      1019
#define DLEN2                         1020
#define DLEN3                         1021
#define CRCDLEN3                      1022
#define SMT1TMRL                      1023
#define SMT1TMR0                      1024
#define SMT1TMRL_SMT1TMR              1025
#define SMT1TMR1                      1026
#define SMT1TMR2                      1027
#define SMT1TMR3                      1028
#define SMT1TMR4                      1029
#define SMT1TMR5                      1030
#define SMT1TMR6                      1031
#define SMT1TMR7                      1032
#define SMT1TMRH                      1033
#define SMT1TMR8                      1034
#define SMT1TMRH_SMT1TMR              1035
#define SMT1TMR9                      1036
#define SMT1TMR10                     1037
#define SMT1TMR11                     1038
#define SMT1TMR12                     1039
#define SMT1TMR13                     1040
#define SMT1TMR14                     1041
#define SMT1TMR15                     1042
#define SMT1TMRU                      1043
#define SMT1TMR16                     1044
#define SMT1TMRU_SMT1TMR              1045
#define SMT1TMR17                     1046
#define SMT1TMR18                     1047
#define SMT1TMR19                     1048
#define SMT1TMR20                     1049
#define SMT1TMR21                     1050
#define SMT1TMR22                     1051
#define SMT1TMR23                     1052
#define SMT1CPRL                      1053
#define SMT1CPRL_SMT1CPR              1054
#define SMT1CPR0                      1055
#define SMT1CPR1                      1056
#define SMT1CPR2                      1057
#define SMT1CPR3                      1058
#define SMT1CPR4                      1059
#define SMT1CPR5                      1060
#define SMT1CPR6                      1061
#define SMT1CPR7                      1062
#define SMT1CPRH                      1063
#define SMT1CPRH_SMT1CPR              1064
#define SMT1CPR8                      1065
#define SMT1CPR9                      1066
#define SMT1CPR10                     1067
#define SMT1CPR11                     1068
#define SMT1CPR12                     1069
#define SMT1CPR13                     1070
#define SMT1CPR14                     1071
#define SMT1CPR15                     1072
#define SMT1CPRU                      1073
#define SMT1CPR16                     1074
#define SMT1CPRU_SMT1CPR              1075
#define SMT1CPR17                     1076
#define SMT1CPR18                     1077
#define SMT1CPR19                     1078
#define SMT1CPR20                     1079
#define SMT1CPR21                     1080
#define SMT1CPR22                     1081
#define SMT1CPR23                     1082
#define SMT1CPWL                      1083
#define SMT1CPW0                      1084
#define SMT1CPWL_SMT1CPW              1085
#define SMT1CPW1                      1086
#define SMT1CPW2                      1087
#define SMT1CPW3                      1088
#define SMT1CPW4                      1089
#define SMT1CPW5                      1090
