tiborsimon/embedded-tdd-headers/pic/pic12/pic12lf1612_tdd.h
#define SMT1CPW6                      1091
#define SMT1CPW7                      1092
#define SMT1CPWH                      1093
#define SMT1CPW8                      1094
#define SMT1CPWH_SMT1CPW              1095
#define SMT1CPW9                      1096
#define SMT1CPW10                     1097
#define SMT1CPW11                     1098
#define SMT1CPW12                     1099
#define SMT1CPW13                     1100
#define SMT1CPW14                     1101
#define SMT1CPW15                     1102
#define SMT1CPWU                      1103
#define SMT1CPWU_SMT1CPW              1104
#define SMT1CPW16                     1105
#define SMT1CPW17                     1106
#define SMT1CPW18                     1107
#define SMT1CPW19                     1108
#define SMT1CPW20                     1109
#define SMT1CPW21                     1110
#define SMT1CPW22                     1111
#define SMT1CPW23                     1112
#define SMT1PRL                       1113
#define SMT1PR0                       1114
#define SMT1PRL_SMT1PR                1115
#define SMT1PR1                       1116
#define SMT1PR2                       1117
#define SMT1PR3                       1118
#define SMT1PR4                       1119
#define SMT1PR5                       1120
#define SMT1PR6                       1121
#define SMT1PR7                       1122
#define SMT1PRH                       1123
#define SMT1PR8                       1124
#define SMT1PRH_SMT1PR                1125
#define SMT1PR9                       1126
#define SMT1PR10                      1127
#define SMT1PR11                      1128
#define SMT1PR12                      1129
#define SMT1PR13                      1130
#define SMT1PR14                      1131
#define SMT1PR15                      1132
#define SMT1PRU                       1133
#define SMT1PR16                      1134
#define SMT1PRU_SMT1PR                1135
#define SMT1PR17                      1136
#define SMT1PR18                      1137
#define SMT1PR19                      1138
#define SMT1PR20                      1139
#define SMT1PR21                      1140
#define SMT1PR22                      1141
#define SMT1PR23                      1142
#define SMT1CON0                      1143
#define SMT1PS0                       1144
#define SMT1PS                        1145
#define SMT1PS1                       1146
#define SMT1CON0_CPOL                 1147
#define SMT1CON0_SPOL                 1148
#define SMT1CON0_WPOL                 1149
#define SMT1CON0_STP                  1150
#define SMT1CON0_EN                   1151
#define SMT1CON1                      1152
#define SMT1MODE0                     1153
#define SMT1CON1_MODE                 1154
#define SMT1CON1_MODE0                1155
#define SMT1MODE                      1156
#define SMT1CON1_MODE1                1157
#define SMT1MODE1                     1158
#define SMT1CON1_MODE2                1159
#define SMT1MODE2                     1160
#define SMT1CON1_MODE3                1161
#define SMT1MODE3                     1162
#define SMT1CON1_REPEAT               1163
#define SMT1REPEAT                    1164
#define SMT1GO                        1165
#define SMT1STAT                      1166
#define SMT1STAT_AS                   1167
#define SMT1AS                        1168
#define SMT1STAT_WS                   1169
#define SMT1WS                        1170
#define SMT1STAT_TS                   1171
#define SMT1TS                        1172
#define SMT1RESET                     1173
#define SMT1STAT_RST                  1174
#define SMT1CPWUP                     1175
#define SMT1STAT_CPWUP                1176
#define SMT1CPRUP                     1177
#define SMT1STAT_CPRUP                1178
#define SMT1CLK                       1179
#define SMT1CLK_CSEL0                 1180
#define SMT1CSEL0                     1181
#define SMT1CSEL                      1182
#define SMT1CLK_CSEL                  1183
#define SMT1CSEL1                     1184
#define SMT1CLK_CSEL1                 1185
#define SMT1CSEL2                     1186
#define SMT1CLK_CSEL2                 1187
#define SMT1SIG                       1188
#define SMT1SSEL                      1189
#define SMT1SIG_SSEL0                 1190
#define SMT1SIG_SSEL                  1191
#define SMT1SSEL0                     1192
#define SMT1SIG_SSEL1                 1193
#define SMT1SSEL1                     1194
#define SMT1SIG_SSEL2                 1195
#define SMT1SSEL2                     1196
#define SMT1WIN                       1197
#define SMT1WSEL                      1198
#define SMT1WSEL0                     1199
#define SMT1WIN_WSEL0                 1200
#define SMT1WIN_WSEL                  1201
#define SMT1WSEL1                     1202
#define SMT1WIN_WSEL1                 1203
#define SMT1WIN_WSEL2                 1204
#define SMT1WSEL2                     1205
#define SMT1WIN_WSEL3                 1206
#define SMT1WSEL3                     1207
#define SMT2TMRL                      1208
#define SMT2TMRL_SMT2TMR              1209
#define SMT2TMR0                      1210
#define SMT2TMR1                      1211
#define SMT2TMR2                      1212
#define SMT2TMR3                      1213
#define SMT2TMR4                      1214
#define SMT2TMR5                      1215
#define SMT2TMR6                      1216
#define SMT2TMR7                      1217
#define SMT2TMRH                      1218
#define SMT2TMR8                      1219
#define SMT2TMRH_SMT2TMR              1220
#define SMT2TMR9                      1221
#define SMT2TMR10                     1222
#define SMT2TMR11                     1223
#define SMT2TMR12                     1224
#define SMT2TMR13                     1225
#define SMT2TMR14                     1226
#define SMT2TMR15                     1227
#define SMT2TMRU                      1228
#define SMT2TMR16                     1229
#define SMT2TMRU_SMT2TMR              1230
#define SMT2TMR17                     1231
#define SMT2TMR18                     1232
#define SMT2TMR19                     1233
#define SMT2TMR20                     1234
#define SMT2TMR21                     1235
#define SMT2TMR22                     1236
#define SMT2TMR23                     1237
#define SMT2CPRL                      1238
#define SMT2CPRL_SMT2CPR              1239
#define SMT2CPR0                      1240
#define SMT2CPR1                      1241
#define SMT2CPR2                      1242
#define SMT2CPR3                      1243
#define SMT2CPR4                      1244
#define SMT2CPR5                      1245
#define SMT2CPR6                      1246
#define SMT2CPR7                      1247
#define SMT2CPRH                      1248
#define SMT2CPR8                      1249
#define SMT2CPRH_SMT2CPR              1250
#define SMT2CPR9                      1251
#define SMT2CPR10                     1252
#define SMT2CPR11                     1253
#define SMT2CPR12                     1254
#define SMT2CPR13                     1255
#define SMT2CPR14                     1256
#define SMT2CPR15                     1257
#define SMT2CPRU                      1258
#define SMT2CPRU_SMT2CPR              1259
#define SMT2CPR16                     1260
#define SMT2CPR17                     1261
#define SMT2CPR18                     1262
#define SMT2CPR19                     1263
#define SMT2CPR20                     1264
#define SMT2CPR21                     1265
#define SMT2CPR22                     1266
#define SMT2CPR23                     1267
#define SMT2CPWL                      1268
#define SMT2CPWL_SMT2CPW              1269
#define SMT2CPW0                      1270
#define SMT2CPW1                      1271
#define SMT2CPW2                      1272
#define SMT2CPW3                      1273
#define SMT2CPW4                      1274
#define SMT2CPW5                      1275
#define SMT2CPW6                      1276
#define SMT2CPW7                      1277
#define SMT2CPWH                      1278
#define SMT2CPWH_SMT2CPW              1279
#define SMT2CPW8                      1280
#define SMT2CPW9                      1281
#define SMT2CPW10                     1282
#define SMT2CPW11                     1283
#define SMT2CPW12                     1284
#define SMT2CPW13                     1285
#define SMT2CPW14                     1286
#define SMT2CPW15                     1287
#define SMT2CPWU                      1288
#define SMT2CPWU_SMT2CPW              1289
#define SMT2CPW16                     1290
#define SMT2CPW17                     1291
#define SMT2CPW18                     1292
#define SMT2CPW19                     1293
#define SMT2CPW20                     1294
#define SMT2CPW21                     1295
#define SMT2CPW22                     1296
#define SMT2CPW23                     1297
#define SMT2PRL                       1298
#define SMT2PRL_SMT2PR                1299
#define SMT2PR0                       1300
#define SMT2PR1                       1301
#define SMT2PR2                       1302
#define SMT2PR3                       1303
#define SMT2PR4                       1304
#define SMT2PR5                       1305
#define SMT2PR6                       1306
#define SMT2PR7                       1307
#define SMT2PRH                       1308
#define SMT2PRH_SMT2PR                1309
#define SMT2PR8                       1310
#define SMT2PR9                       1311
#define SMT2PR10                      1312
#define SMT2PR11                      1313
#define SMT2PR12                      1314
#define SMT2PR13                      1315
#define SMT2PR14                      1316
#define SMT2PR15                      1317
#define SMT2PRU                       1318
#define SMT2PRU_SMT2PR                1319
#define SMT2PR16                      1320
#define SMT2PR17                      1321
#define SMT2PR18                      1322
#define SMT2PR19                      1323
#define SMT2PR20                      1324
#define SMT2PR21                      1325
#define SMT2PR22                      1326
#define SMT2PR23                      1327
#define SMT2CON0                      1328
#define SMT2PS0                       1329
#define SMT2PS                        1330
#define SMT2PS1                       1331
#define SMT2CON0_CPOL                 1332
#define SMT2CON0_SPOL                 1333
#define SMT2CON0_WPOL                 1334
#define SMT2CON0_STP                  1335
#define SMT2CON0_EN                   1336
#define SMT2CON1                      1337
#define SMT2CON1_MODE                 1338
#define SMT2CON1_MODE0                1339
#define SMT2MODE0                     1340
#define SMT2MODE                      1341
#define SMT2CON1_MODE1                1342
#define SMT2MODE1                     1343
#define SMT2CON1_MODE2                1344
#define SMT2MODE2                     1345
#define SMT2CON1_MODE3                1346
#define SMT2MODE3                     1347
#define SMT2REPEAT                    1348
#define SMT2CON1_REPEAT               1349
#define SMT2GO                        1350
#define SMT2STAT                      1351
#define SMT2AS                        1352
#define SMT2STAT_AS                   1353
#define SMT2WS                        1354
#define SMT2STAT_WS                   1355
#define SMT2STAT_TS                   1356
#define SMT2TS                        1357
#define SMT2RESET                     1358
#define SMT2STAT_RST                  1359
#define SMT2CPWUP                     1360
#define SMT2STAT_CPWUP                1361
#define SMT2STAT_CPRUP                1362
#define SMT2CPRUP                     1363
#define SMT2CLK                       1364
#define SMT2CLK_CSEL                  1365
#define SMT2CSEL0                     1366
#define SMT2CLK_CSEL0                 1367
#define SMT2CSEL                      1368
#define SMT2CSEL1                     1369
#define SMT2CLK_CSEL1                 1370
#define SMT2CSEL2                     1371
#define SMT2CLK_CSEL2                 1372
#define SMT2CSEL3                     1373
#define CSEL3                         1374
#define SMT2CSEL4                     1375
#define CSEL4                         1376
#define SMT2CSEL5                     1377
#define CSEL5                         1378
#define SMT2CSEL6                     1379
#define CSEL6                         1380
#define SMT2CSEL7                     1381
#define CSEL7                         1382
#define SMT2SIG                       1383
#define SMT2SIG_SSEL0                 1384
#define SMT2SIG_SSEL                  1385
#define SMT2SSEL0                     1386
#define SMT2SSEL                      1387
#define SMT2SIG_SSEL1                 1388
#define SMT2SSEL1                     1389
#define SMT2SIG_SSEL2                 1390
#define SMT2SSEL2                     1391
#define SSEL3                         1392
#define SMT2SSEL3                     1393
#define SSEL4                         1394
#define SMT2SSEL4                     1395
#define SSEL5                         1396
#define SMT2SSEL5                     1397
#define SSEL6                         1398
#define SMT2SSEL6                     1399
#define SSEL7                         1400
#define SMT2SSEL7                     1401
#define SMT2WIN                       1402
#define SMT2WSEL0                     1403
#define SMT2WIN_WSEL0                 1404
#define SMT2WSEL                      1405
#define SMT2WIN_WSEL                  1406
#define SMT2WSEL1                     1407
#define SMT2WIN_WSEL1                 1408
#define SMT2WSEL2                     1409
#define SMT2WIN_WSEL2                 1410
#define SMT2WSEL3                     1411
#define SMT2WIN_WSEL3                 1412
#define SMT2WSEL4                     1413
#define WSEL4                         1414
#define SMT2WSEL5                     1415
#define WSEL5                         1416
#define SMT2WSEL6                     1417
#define WSEL6                         1418
#define SMT2WSEL7                     1419
#define WSEL7                         1420
#define STATUS_SHAD                   1421
#define C_SHAD                        1422
#define DC_SHAD                       1423
#define Z_SHAD                        1424
#define WREG_SHAD                     1425
#define BSR_SHAD                      1426
#define PCLATH_SHAD                   1427
#define FSR0L_SHAD                    1428
#define FSR0H_SHAD                    1429
#define FSR1L_SHAD                    1430
#define FSR1H_SHAD                    1431
#define STKPTR                        1432
#define TOSL                          1433
#define TOSH                          1434

#endif // _PIC12LF1612_H_
